<a href="https://colab.research.google.com/github/WillDera/Pandas---more-than-an-animal/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
days = pd.Series(['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday'])

In [ ]:
days

0       Monday
1      Tuesday
2    Wednesday
3     Thursday
4       Friday
dtype: object

In [ ]:
indexedDays = pd.Series(['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday'], index=['a', 'b', 'c', 'd', 'e'])

In [ ]:
indexedDays

a       Monday
b      Tuesday
c    Wednesday
d     Thursday
e       Friday
dtype: object

In [ ]:
indexedDays[0]

'Monday'

In [ ]:
indexedDays['d']

'Thursday'

In [ ]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [ ]:
# create a dataframe from a dictionary
df_dict = {'Country': ['Ghana', 'Kenya', 'Nigeria', 'Togo'],
           'Capital': ['Accra', 'Nairobi', 'Abuja', 'Lome'],
           'Population': [10000, 8500, 35000, 12000],
           'Age': [60, 70, 80, 75]
           }

In [ ]:
df = pd.DataFrame(df_dict, index=[2, 4, 6, 8])

In [ ]:
df

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

In [ ]:
df_list = [['Ghana', 'Accra', 10000, 60], 
           ['Kenya', 'Nairobi', 8500, 70], 
           ['Nigeria',   'Abuja', 35000, 80], 
           ['Togo', 'Lome', 12000, 75]]

In [ ]:
df1 = pd.DataFrame(df_list, columns=['Country', 'Capital', 'Population', 'Age'], index=[2, 4 ,6, 8])

In [ ]:
df1

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

In [ ]:
df.iloc[0:3]

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80

In [ ]:
df.loc[4]

Country         Kenya
Capital       Nairobi
Population       8500
Age                70
Name: 4, dtype: object

In [ ]:
df['Country']

2      Ghana
4      Kenya
6    Nigeria
8       Togo
Name: Country, dtype: object

In [ ]:
df.at[6, 'Country']

'Nigeria'

In [ ]:
df.iat[3, 2]

12000

In [ ]:
print(df1)
print(df1.iat[2, 3], df1.iat[2, 0])

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75
80 Nigeria

In [ ]:
df1['Population'].sum()

65500

In [ ]:
df1.describe()

         Population        Age
count      4.000000   4.000000
mean   16375.000000  71.250000
std    12499.166639   8.539126
min     8500.000000  60.000000
25%     9625.000000  67.500000
50%    11000.000000  72.500000
75%    17750.000000  76.250000
max    35000.000000  80.000000

In [ ]:
import numpy as np
df_dict2 = {'Name': ['James', 'Yemen', 'Caro', np.nan],
           'Profession': ['Researcher', 'Artist', 'Doctor', 'Writer'],
           'Experience': [12, np.nan, 10, 8],
           'Height': [np.nan, 175, 180, 150]}

In [ ]:
new_df = pd.DataFrame(df_dict2)

In [ ]:
new_df

    Name  Profession  Experience  Height
0  James  Researcher        12.0     NaN
1  Yemen      Artist         NaN   175.0
2   Caro      Doctor        10.0   180.0
3    NaN      Writer         8.0   150.0

In [ ]:
new_df.notnull()

    Name  Profession  Experience  Height
0   True        True        True   False
1   True        True       False    True
2   True        True        True    True
3  False        True        True    True

In [ ]:
dropping = new_df.fillna(method='backfill' )

In [ ]:
dropping.fillna(value="John")

    Name  Profession  Experience  Height
0  James  Researcher        12.0   175.0
1  Yemen      Artist        10.0   175.0
2   Caro      Doctor        10.0   180.0
3   John      Writer         8.0   150.0